Revit 2024 API
DocumentWorksharingEnabledEventArgs Methods
The DocumentWorksharingEnabledEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDocument
 Returns document associated with this event
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace